test/performance/benchmarks/real-traffic-test/results/preempt-k8s/10_seconds-10_interfering/2026-02-23_23-15-33/vegeta_metrics.txt
=== Real Traffic Test Results ===


== Test Configuration ==

Services: 10
RPS: 50
Duration: 1m0s
Min Latency: 0s
Max Latency: 0s
Min Startup Latency: 0s
Max Startup Latency: 0s
Min Payload Size (bytes): 10000
Max Payload Size (bytes): 10000
Critical Test: true
Sources of Interference: 10
Interfering Namespace: interference
Bucket Node: dessertw3


== Test Results ==

= Aggregated Results =

Requests      [total, rate, throughput]         3000, 50.02, 50.01
Duration      [total, attack, wait]             59.986s, 59.98s, 5.891ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.845ms, 113.447ms, 6.346ms, 10.369ms, 575.733ms, 2.974s, 3.88s
Bytes In      [total, mean]                     29134725, 9711.58
Bytes Out     [total, mean]                     30000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:

= Per-Service Results =

# Service: perftest-0
Criticality Level: 1

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.304ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.958ms, 113.014ms, 6.145ms, 9.881ms, 585.835ms, 2.974s, 3.475s
Bytes In      [total, mean]                     2913770, 9712.57
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-1
Criticality Level: 2

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.147ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.848ms, 125.504ms, 6.081ms, 9.41ms, 789.321ms, 3.179s, 3.661s
Bytes In      [total, mean]                     2912820, 9709.40
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-2
Criticality Level: 3

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.875ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.845ms, 138.992ms, 6.045ms, 10.399ms, 987.322ms, 3.382s, 3.88s
Bytes In      [total, mean]                     2913854, 9712.85
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-3
Criticality Level: 4

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.6ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.23ms, 96.361ms, 6.408ms, 10.102ms, 277.652ms, 2.692s, 3.161s
Bytes In      [total, mean]                     2913653, 9712.18
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-4
Criticality Level: 5

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 7.108ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.113ms, 113.135ms, 6.457ms, 10.722ms, 572.026ms, 2.963s, 3.457s
Bytes In      [total, mean]                     2913669, 9712.23
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-5
Criticality Level: 6

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 6.803ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.248ms, 96.82ms, 6.541ms, 10.749ms, 290.345ms, 2.692s, 3.153s
Bytes In      [total, mean]                     2913657, 9712.19
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-6
Criticality Level: 7

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.808s, 59.8s, 7.946ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.257ms, 103.536ms, 6.383ms, 10.3ms, 410.593ms, 2.805s, 3.282s
Bytes In      [total, mean]                     2913644, 9712.15
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-7
Criticality Level: 8

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 6.819ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.298ms, 98.057ms, 6.43ms, 10.084ms, 316.032ms, 2.718s, 3.177s
Bytes In      [total, mean]                     2912467, 9708.22
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-8
Criticality Level: 9

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.815ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.199ms, 136.807ms, 6.5ms, 12.209ms, 965.62ms, 3.363s, 3.821s
Bytes In      [total, mean]                     2913652, 9712.17
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-9
Criticality Level: 10

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.891ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.171ms, 112.247ms, 6.41ms, 11.265ms, 571.868ms, 2.945s, 3.435s
Bytes In      [total, mean]                     2913539, 9711.80
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set: